#pragma once
#include"CAddress.h"
#include<stdio.h>
#include<string>
#include<vector>
#include<stdlib.h>
#include"define.h"

//-------------------------------------------------------------------------------
// CFileImporter
//-------------------------------------------------------------------------------
//住所録ファイルの読み取りとアドレス作成をする
class CFileImporter
{
public:
//-------------------------------------------------------------------------------
// コンストラクタ
//-------------------------------------------------------------------------------
//メンバ変数の初期化
	CFileImporter(
		string inFilePath);//読み込むファイルの相対パス

//-------------------------------------------------------------------------------
// デストラクタ
//-------------------------------------------------------------------------------
//ファイルオープンしているなら閉じる
	~CFileImporter();

//-------------------------------------------------------------------------------
// fileOpen()
//-------------------------------------------------------------------------------
//ファイルオープンする
	bool//ファイルオープンの状態を返す
		fileOpen();
//-------------------------------------------------------------------------------
// readFile
//-------------------------------------------------------------------------------
//住所録ファイルを読み込む
	void
		readFile();


//-------------------------------------------------------------------------------
// setAddressVector()
//-------------------------------------------------------------------------------
//読み込んだAddressのベクタを渡す
	vector<CAddress>&
		setAddressVector();



private:
	//ファイルオープンした時のファイルポインタ
	FILE* m_fp;
	//住所録ファイルから作った住所録情報群
	vector<CAddress>* m_AddressArray;
	//ファイルオープンした時のエラーコード
	errno_t m_err;
	//操作するファイルの相対パス
	string m_filePath;
};

