#pragma once
#include<stdio.h>
#include<vector>
#include"CAddress.h"

//-------------------------------------------------------------------------------
// CFileExporter
//-------------------------------------------------------------------------------
//編集した住所録をファイルに書き込む
class CFileExporter
{
public:
//-------------------------------------------------------------------------------
// コンストラクタ
//-------------------------------------------------------------------------------
//各メンバ変数の初期化
	CFileExporter(
		string inFilePath);//書き込むファイルの相対パス

	
//-------------------------------------------------------------------------------
// デストラクタ
//-------------------------------------------------------------------------------
//ファイルを閉じる
	~CFileExporter();

//-------------------------------------------------------------------------------
// fileOpen()
//-------------------------------------------------------------------------------
//ファイルオープンする
	bool//ファイルオープンの状態を返す
		fileOpen();

//-------------------------------------------------------------------------------
// writeFile()
//-------------------------------------------------------------------------------
//住所録の操作後の住所録をファイルに書き込む
	void writeFile(const vector<CAddress>& inAddressArray);



private:
	//ファイルオープンした時のファイルポインタ
	FILE* m_fp;
	//ファイルオープンした時のエラーコード
	errno_t m_err;
	//操作するファイルの相対パス
	string m_filePath;
};

